Repository: vim-doc-es/vimdocs
Catalog: 7.3/recursos_de_traduccion/doc-compendium.tmx
Source language: en
Languages: es_es

source: As an example, consider using "~/.vim/plugin/perl/*.vim" for all your Perl plugins.
es_es: Por ejemplo, ponga todas sus extensiones de Perl bajo el subdirectorio «~/.vim/plugin/perl/*.vim».

source: See |vimrc-filetype|.
es_es: Véase |vimrc-filetype|.

source: If you are missing a plugin for a filetype you are using, or you found a better one, you can add it.
es_es: Si echa de menos una extensión para un tipo de archivo que esté usando, o encontró uno mejor, puede añadirlo.

source: There are two steps for adding a filetype plugin: 1.
es_es: Hay dos pasos para conseguirlo: 1.

source: Get a copy of the plugin.
es_es: Conseguir una copia de la extensión.

source: You can find them in the same places as the global plugins.
es_es: Puede encontrarlos en los mismos sitios que las extensiones globales.

source: Watch out if the type of file is mentioned, then you know if the plugin is a global or a filetype one.
es_es: Compruebe si el tipo de archivo se menciona o no, de ese modo puede saber si la extensión es global o de tipo de archivo.

source: The scripts in $VIMRUNTIME/macros are global ones, the filetype plugins are in $VIMRUNTIME/ftplugin.
es_es: Los scripts en «$VIMRUNTIME/macros» son globales, los específicos están en «$VIMRUNTIME/ftplugin».

source: You can add a filetype plugin by dropping it in the right directory.
es_es: Puede añadir una extensión de tipo de archivo ubicándolo en el directorio adecuado.

source: The name of this directory is in the same directory mentioned above for global plugins, but the last part is "ftplugin".
es_es: El nombre de este directorio está en el mismo directorio mencionado previamente para extensiones globales, pero la última parte es «ftplugin».

source: Suppose you have found a plugin for the "stuff" filetype, and you are on Unix.
es_es: Suponga que ha encontrado una extensión para el tipo de archivo «cosas» y que está bajo Unix.

source: Then you can move this file to the ftplugin directory: >
es_es: Puede mover este archivo al directorio «ftplugin/»: >

source: If that file already exists you already have a plugin for "stuff".
es_es: Si ese archivo ya existe, es que ya tiene una extensión para «cosas».

source: You might want to check if the existing plugin doesn't conflict with the one you are adding.
es_es: Tal vez desee comprobar si la extensión existente no es conflictivo con el que añade.

source: If it's OK, you can give the new one another name: >
es_es: Si no hay conflicto, puede darle otro nombre:

source: The underscore is used to separate the name of the filetype from the rest, which can be anything.
es_es: El guión bajo se usa para separar el nombre del tipo de archivo del resto, que puede ser cualquier cosa.

source: If you use "otherstuff.vim" it wouldn't work, it would be loaded for the "otherstuff" filetype.
es_es: Si usa «otrascosas.vim» no funcionaría, ya que se cargaría como tipo de archivo «otrascosas».

source: On MS-DOS you cannot use long filenames.
es_es: En MS-DOS no puede usar nombres de archivo largos.

source: You would run into trouble if you add a second plugin and the filetype has more than six characters.
es_es: Tendrá problemas si añades una segunda extensión el tipo de archivo tiene más de seis caracteres.

source: You can use an extra directory to get around this: >
es_es: Puede añadir un directorio extra para evitar este problema: >

source: Here "<name>" can be any name that you prefer.
es_es: Aquí, «<nombre>» puede ser cualquier nombre que quieras.

source: Examples for the "stuff" filetype on Unix: >
es_es: Ejemplos para el tipo de archivo «cosas» en Unix: >

source: The <filetype> part is the name of the filetype the plugin is to be used for.
es_es: La parte <tipo_de_archivo> es el nombre del tipo de archivo para el cuál se usa la extensión.

source: Only files of this filetype will use the settings from the plugin.
es_es: Sólo los archivos de este tipo cargarán esta extensión.

source: The <name> part of the plugin file doesn't matter, you can use it to have several plugins for the same filetype.
es_es: La parte <nombre> de la extensión no importa, puede usarlo para tener varias extensiones del mismo tipo de archivo.

source: Note that it must end in ".vim".
es_es: Tenga en cuenta que debe terminar con la extensión «.vim».

source: Further reading: |filetype-plugins| Documentation for the filetype plugins and information about how to avoid that mappings cause problems.
es_es: Lecturas de ampliación: |filetype-plugins| Documentación para las extensiones de tipo de archivo e información sobre como evitar problemas con macros.

source: |load-plugins| When the global plugins are loaded during startup.
es_es: |load-plugins| Cuándo las extensiones globales se cargan.

source: |ftplugin-overrule| Overruling the settings from a global plugin.
es_es: |ftplugin-overrule| Sobreescribir las opciones de una extensión global.

source: |write-plugin| How to write a plugin script.
es_es: |write-plugin| Cómo escribir un script de extensión.

source: |plugin-details| For more information about using plugins or when your plugin doesn't work.
es_es: |plugin-details| Para más información sobre cómo usar extensiones o cuando la extensión no funciona.

source: |new-filetype| How to detect a new file type.
es_es: |new-filetype| Cómo detectar un nuevo tipo de archivo.

source: If you are lucky, the plugin you installed also comes with a help file.
es_es: Si tiene suerte, la extensión que instaló viene con un archivo de ayuda.

source: We will explain how to install the help file, so that you can easily find help for your new plugin.
es_es: Le explicaremos cómo instalar el archivo de ayuda, para que pueda encontrar ayuda fácilmente para su nueva extensión.

source: Let us use the "matchit.vim" plugin as an example (it is included with Vim).
es_es: Usemos el plugin «matchit.vim» como ejemplo (viene incluido con Vim).

source: This plugin makes the "%" command jump to matching HTML tags, if/else/endif in Vim scripts, etc.
es_es: Esta extensión hace que la orden «%» salte a tags emparejados de HTML, «if/else/endif» en scripts de Vim, etc.

source: Very useful, although it's not backwards compatible (that's why it is not enabled by default).
es_es: Muy útil, pero no es compatible con versiones anteriores (por lo que no está activado por defecto).

source: This plugin comes with documentation: "matchit.txt".
es_es: Esta extensión viene con la documentación «matchit.txt».

source: Let's first copy the plugin to the right directory.
es_es: Primero copiemos la extensión al directorio adecuado.

source: This time we will do it from inside Vim, so that we can use $VIMRUNTIME.
es_es: Esta vez lo haremos desde dentro de Vim, así podremos usar $VIMRUNTIME.

source: (You may skip some of the "mkdir" commands if you already have the directory.) >
es_es: (Puede omitir la orden «mkdir» si ya tiene el directorio.) >

source: Now create a "doc" directory in one of the directories in 'runtimepath'.
es_es: Ahora cree un directorio «doc» en una de los directorios de 'runtimepath'.

source: Copy the help file to the "doc" directory.
es_es: Copie el archivo de ayuda al directorio «doc».

source: Now comes the trick, which allows you to jump to the subjects in the new help file: Generate the local tags file with the |:helptags| command.
es_es: Por último el truco que le permite ir a los temas en el nuevo archivo de ayuda: Genere el archivo de tags locales con la orden |:helptags|.

source: command to find help for "g%" in the help file you just added.
es_es: para buscar ayuda para «g%» en el archivo de ayuda que acaba de añadir.

source: You can see an entry for the local help file when you do: >
es_es: Puede ver una entrada correspondiente al archivo local cuando escriba: >

source: The title lines from the local help files are automagically added to this section.
es_es: Las líneas con los títulos de los archivos de ayuda locales son añadidos automágicamente a la sección.

source: There you can see which local help files have been added and jump to them through the tag.
es_es: Allí puede ver que archivos locales se han añadido e ir a ellos a través del tag creado.

source: If you are looking for an option that does what you want, you can search in the help files here: |options|.
es_es: Si busca una opción que haga lo que quiere, puede buscarla en los archivos de ayuda aquí: |options|.

source: Another way is by using this command: >
es_es: Otra forma es usar la orden: >

source: You can change the value of an option.
es_es: Puede cambiar el valor de una opción.

source: For example, move to the "displaying text" subject.
es_es: Por ejemplo, vaya al tema «displaying text».

source: Then move the cursor down to this line:
es_es: Luego ponga el cursor abajo, en esta línea:

source: Just above this line is a short description of the 'wrap' option.
es_es: Justo sobre esta línea hay una descripción corta de la opción 'wrap'.

source: Move the cursor one line up to place it in this line.
es_es: Ponga el cursor una línea arriba para colocarlos sobre esta línea.

source: Now hit <Enter> and you jump to the full help on the 'wrap' option.
es_es: Ahora pulse <Intro> e irá hacia la descripción completa de la opción 'wrap'.

source: For options that take a number or string argument you can edit the value.
es_es: Para opciones que toman un número o una cadena de caracteres puede editar el valor.

source: For example, move the cursor a few lines up to this line:
es_es: Por ejemplo, mueva el cursor unas cuantas líneas arriba hasta esta línea:

source: Position the cursor on the zero with "$".
es_es: Posicione el cursor sobre el cero con «$».

source: Change it into a five with "r5".
es_es: Modifiqueló a un cinco con «r5».

source: When you now move the cursor around you will notice that the text starts scrolling before you reach the border.
es_es: Cuando mueva el cursor por un texto, notará que el texto se desplazará (scroll) antes de que llegue al borde.

source: This is what the 'scrolloff' option does, it specifies an offset from the window border where scrolling starts.
es_es: Esto es lo que la opción 'scrolloff' hace, especifica una compensación (offset) del punto donde comienza el desplazamiento (respecto al borde).

source: There are an awful lot of options.
es_es: Hay una cantidad de opciones inmensa.

source: Most of them you will hardly ever use.
es_es: Difícilmente llegará a usar gran parte de ellas.

source: Some of the more useful ones will be mentioned here.
es_es: Algunas de las más comunes se citarán a continuación.

source: Don't forget you can find more help on these options with the ":help" command, with single quotes before and after the option name.
es_es: No se olvide de que puede encontrar más ayuda con la orden «:help», con comillas simples alrededor del nombre de la opción.

source: In case you have messed up an option value, you can set it back to the default by putting an ampersand (&) after the option name.
es_es: En caso de que haya descolocado el valor de una opción, puede devolverlo a la opción por defecto con un et (&) tras el nombre de la opción.

source: Vim normally wraps long lines, so that you can see all of the text.
es_es: Vim normalmente dobla líneas largas, de forma que pueda ver todo el texto.

source: Sometimes it's better to let the text continue right of the window.
es_es: A veces es mejor dejar que el texto continúe a la derecha de la ventana.

source: Then you need to scroll the text left-right to see all of a long line.
es_es: De este modo tiene que desplazarse de izquierda a derecha para ver toda una línea larga.

source: Switch wrapping off with this command: >
es_es: Puede intercambiar el valor con la siguiente orden: >

source: Vim will automatically scroll the text when you move to text that is not displayed.
es_es: Vim automáticamente desplazará el texto cuando se desplace hacia el texto que no se muestra en pantalla.

source: To see a context of ten characters, do this: >
es_es: Para ver un contexto de diez caracteres: >

source: Most commands for moving around will stop moving at the start and end of a line.
es_es: La mayoría de las órdenes para desplazarse dejarán de funcionar al comienzo o al final de una línea.

source: You can change that with the 'whichwrap' option.
es_es: Puede cambiar esto con la opción 'whichwrap'.

source: This sets it to the default value: >
es_es: Esto la cambia al valor predeterminado: >

source: This allows the <BS> key, when used in the first position of a line, to move the cursor to the end of the previous line.
es_es: Esto permite que la tecla <Retroceso>, cuando se emplea en la primera posición de una línea se mueva al final de la línea anterior.

source: And the <Space> key moves from the end of a line to the start of the next one.
es_es: También la tecla <Espacio> le desplazará desde el final de una línea hasta el comienzo de la siguiente.

source: This is still only for Normal mode.
es_es: Esto es exclusivamente en el modo Normal.

source: To let <Left> and <Right> do this in Insert mode as well: >
es_es: Para permitir que <Izq> y <Der> haga esto en también modo Insertar, escriba: >

source: When there are tabs in a file, you cannot see where they are.
es_es: Cuando hay pestañas en un archivo, no puede ver dónde están.

source: To make them visible: >
es_es: Para hacerlas visibles: >

source: Now every tab is displayed as ^I.
es_es: Ahora todas las pestañas se mostrarán como ^I.

source: And a $ is displayed at the end of each line, so that you can spot trailing spaces that would otherwise go unnoticed.
es_es: Un «$» se mostrará al final de cada línea, permitiéndole ver espacios finales que de otra forma pasarían desapercibidos.

source: A disadvantage is that this looks ugly when there are many Tabs in a file.
es_es: Una desventaja de esto es que tiene una apariencia desagradable cuando hay muchas pestañas.

source: If you have a color terminal, or are using the GUI, Vim can show the spaces and tabs as highlighted characters.
es_es: Si tiene una terminal con colores o usa GVim, puede ver los espacios y las pestañas como marcas de color.

source: Use the 'listchars' option: >
es_es: Use la opción 'listchars': >

source: Now every tab will be displayed as ">---" (with more or less "-") and trailing white space as "-".
es_es: Ahora cada pestaña se mostrará como «>---» (con más o menos «-») y los espacios al final de la línea como «-».

source: Looks a lot better, doesn't it?
es_es: Más agradable, o no?

source: The "@" stands for all alphabetic letters.
es_es: El «@» implica todas las letras del alfabeto.

source: "48-57" stands for ASCII characters 48 to 57, which are the numbers 0 to 9.
es_es: «48-57» significa los caracteres ASCII 48 a 57, que son los números 0 a 9.

source: "192-255" are the printable latin characters.
es_es: «192-255» son los caracteres latinos imprimibles.

source: Sometimes you will want to include a dash in keywords, so that commands like "w" consider "upper-case" to be one word.
es_es: A veces querrá incluir un guión en las palabras clave, para que órdenes como «w» consideren «upper-case» como una sola palabra.

source: You can do it like this: >
es_es: Puede hacerlo así: >

source: If you look at the new value, you will see that Vim has added a comma for you.
es_es: Si miras el nuevo valor, comprobará que Vim ha añadido una coma por Ud.

source: To remove a character use "-=".
es_es: Para eliminar un carácter usa «-=».

source: For example, to remove the underscore: >
es_es: Por ejemplo, el guión bajo: >

source: When Vim starts there is one line at the bottom that is used for messages.
es_es: Cuando Vim arranca hay una línea en la parte de abajo que se usa para mensajes.

source: When a message is long, it is either truncated, thus you can only see part of it, or the text scrolls and you have to press <Enter> to continue.
es_es: Cuando un mensaje es largo, o se trunca (con lo que sólo puede ver una parte) o el texto se desplaza y tienes que pulsar <Intro> para continuar.

source: You can set the 'cmdheight' option to the number of lines used for messages.
es_es: Puedes asignar a la opción 'cmdheight' el número de líneas usado para mensajes.

source: *usr_32.txt* For Vim version 7.3.
es_es: *usr_32.esx* Para Vim versión 7.3.

source: Vim provides multi-level undo.
es_es: Vim ofrece varios niveles de deshacer.

source: If you undo a few changes and then make a new change you create a branch in the undo tree.
es_es: Si deshace unos cuantos cambios y después realiza uno nuevo, creará una rama en el árbol de deshacer.

source: This text is about moving through the branches.
es_es: El texto a continuación trata acerca de desplazarse por las ramas.

source: Sometimes you make several changes, and then discover you want to go back to when you have last written the file.
es_es: A veces realiza una serie de cambios, y se da cuenta que desea volver al punto en el que editó el archivo por última vez.

source: You can do that with this command: >
es_es: Puede hacer esto con la siguiente orden: >

source: You can repeat this command to go further back in the past.
es_es: Puede repetir esta orden para retroceder aun más.

source: Or use a count different from 1 to go back faster.
es_es: O usar un número diferente de 1 para retroceder más rápido.

source: Note that these commands really work in time sequence.
es_es: Tenga en cuenta que estas órdenes funcionan secuencialmente.

source: This matters if you made changes after undoing some changes.
es_es: Importa si realiza cambios después de deshacer otros.

source: It's explained in the next section.
es_es: Se explica en la siguiente sección.

source: Also note that we are talking about text writes here.
es_es: Tenga también en cuenta que nos referimos a ediciones de texto.

source: For writing the undo information in a file see |undo-persistence|.
es_es: Para escribir la información de deshacer de en un archivo, consulte |undo-persistence|.

source: In section |02.5| we only discussed one line of undo/redo.
es_es: En la sección |02.5| sólo tratamos una línea temporal de deshacer o rehacer.

source: But it is also possible to branch off.
es_es: Pero también es posible crear una nueva «rama».

source: This happens when you undo a few changes and then make a new change.
es_es: Ocurre cuando deshace algunos cambios y después realiza un nuevo cambio.

source: The new changes become a branch in the undo tree.
es_es: Los cambios nuevos se convierten en una rama del árbol de deshacer.

source: Let's start with the text "one".
es_es: Empecemos con el texto «one».

source: The first change to make is to append " too".
es_es: El primer cambio es añadir «too».

source: And then move to the first 'o' and change it into 'w'.
es_es: Después, ir a la primera «o» y cambiarla a «w».

source: We then have two changes, numbered 1 and 2, and three states of the text:
es_es: Tenemos ahora dos cambios, 1 y 2, y tres estados del texto:

source: You can now use the |u| command to undo.
es_es: Ahora puede usar la orden |u| para deshacer.

source: If you do this twice you get to "one".
es_es: Si lo hace dos veces, obtendrá «one».

source: Use |CTRL-R| to redo, and you will go to "one too".
es_es: Use |CTRL-R| para rehacer, y obtendrá «one too».

source: One more |CTRL-R| takes you to "me too".
es_es: Pulsar |CTRL-R| una vez más le lleva a «me too».

source: Thus undo and redo go up and down in the tree, using the branch that was last used.
es_es: Esto es, deshacer y rehacer suben y bajan un árbol usando la rama usada por última vez.

source: What matters here is the order in which the changes are made.
es_es: Lo que importa es el orden de las cambios.

source: Undo and redo are not considered changes in this context.
es_es: Deshacer y rehacer no se consideran cambios en este contexto.

source: After each change you have a new state of the text.
es_es: Tras cada cambio tiene un nuevo estado del texto.

source: Note that only the changes are numbered, the text shown in the tree above has no identifier.
es_es: Tenga en cuenta que sólo se enumeran los cambios, y el texto que aparece en el árbol anterior no tiene identificador.

source: They are mostly referred to by the number of the change above it.
es_es: Se hace referencia a ellos según el número del cambio por encima suyo.

source: But sometimes by the number of one of the changes below it, especially when moving up in the tree, so that you know which change was just undone.
es_es: Pero, a veces, según el número por debajo de él, particularmente al subir el árbol, para así saber qué cambio se ha deshecho recientemente.

source: So how do you get to "one two" now?
es_es: ¿Cómo podemos obtener «one two» ahora?

source: You can use this command: >
es_es: Puede usar esta orden: >

source: The text is now "one two", you are below change 2.
es_es: Ahora, el texto es «one two», y está bajo el cambio 2.

source: You can use the |:undo| command to jump to below any change in the tree.
es_es: Puede usar la orden |:undo| para saltar a cualquier cambio dentro del árbol.

source: Now you change your mind and want to go back to "me too".
es_es: Ahora cambia de idea, y desea volver a «me too».

source: Use the |g-| command.
es_es: Use la orden |g-|.

source: This moves back in time.
es_es: Esto vuelve a un momento anterior.

source: Thus it doesn't walk the tree upwards or downwards, but goes to the change made before.
es_es: No se desplaza por el árbol en una dirección u otra, sino que vuelve al último cambio realizado.

source: Using |:undo| is useful if you know what change you want to jump to.
es_es: Usar |:undo| es útil si sabe a qué cambio quiere pasar.

source: |g-| and |g+| are useful if you don't know exactly what the change number is.
es_es: |g-| y |g+| son útiles si no sabe exactamente el número del cambio.

source: When you have been working on text for a while the tree grows to become big.
es_es: Cuando ha estado trabajando en el texto durante un rato el árbol crece hasta ser bastante grande.

source: Then you may want to go to the text of some minutes ago.
es_es: Así, puede que desee volver a como era el texto hace unos minutos.

source: Here you can see the number of the leaves in each branch and when the change was made.
es_es: Aquí puede ver el número de hojas en cada rama el momento en que se realizó el cambio.

source: Assuming we are below change 4, at "not two", you can go back ten seconds with this command: >
es_es: Suponiendo que estamos bajo el nivel 4, en «not two», puede retroceder 10 segundos con la siguiente orden:

source: Depending on how much time you took for the changes you end up at a certain position in the tree.
es_es: Dependiendo del tiempo que le tomó realizar los cambios, acabará en una posición determinada del árbol.

source: The |:earlier| command argument can be "m" for minutes, "h" for hours and "d" for days.
es_es: El argumento de la orden |:earlier| puede ser «m», de minutos, «h» de horas y «d» de días.

source: To go all the way back use a big number: >
es_es: Para volver al principio use un número grande: >

source: If you want even more details, or want to manipulate the information, you can use the |undotree()| function.
es_es: Si desea más detalles, o manipular la información, puede usar la función |undotree()|.

source: To see what it returns: >
es_es: Para ver qué devuelve: >

source: *usr_25.txt* For Vim version 7.3.
es_es: *usr_25.esx* Para Vim versión 7.3.

source: Text hardly ever comes in one sentence per line.
es_es: El texto rara vez aparece como una oración por línea.

source: This chapter is about breaking sentences to make them fit on a page and other formatting.
es_es: Este capítulo trata acerca de formatear oraciones para su correcta apariencia en un papel, así como otros formatos.
